import sys
sys.dont_write_bytecode=True

def upside_down_text(text):
    upside_down_chars = {
        'a': 'ɐ', 'b': 'q', 'c': 'ɔ', 'd': 'p', 'e': 'ǝ', 'f': 'ɟ', 'g': 'ɓ', 'h': 'ɥ', 'i': 'ᴉ', 'j': 'ɾ',
        'k': 'ʞ', 'l': 'l', 'm': 'ɯ', 'n': 'u', 'o': 'o', 'p': 'd', 'q': 'b', 'r': 'ɹ', 's': 's', 't': 'ʇ',
        'u': 'n', 'v': 'ʌ', 'w': 'ʍ', 'x': 'x', 'y': 'ʎ', 'z': 'z',
        'A': '∀', 'B': 'q', 'C': 'Ɔ', 'D': 'p', 'E': 'Ǝ', 'F': 'Ⅎ', 'G': '⅁', 'H': 'H', 'I': 'I', 'J': 'ſ',
        'K': 'ʞ', 'L': '˥', 'M': 'W', 'N': 'N', 'O': 'O', 'P': 'Ԁ', 'Q': 'b', 'R': 'Я', 'S': 'S', 'T': '┴',
        'U': '∩', 'V': 'ʌ', 'W': 'ʍ', 'X': 'X', 'Y': 'ʎ', 'Z': 'Z',
        '1': 'Ɩ', '2': 'ᄅ', '3': 'Ɛ', '4': 'ㄣ', '5': 'ϛ', '6': '9', '7': 'ㄥ', '8': '8', '9': '6', '0': '0',
        ',': ',', '.': '.', '?': '¿', '!': '¡', "'": ',', '"': ',,', '`': ',',
        '(': ')', ')': '(', '[': ']', ']': '[', '{': '}', '}': '{', '<': '>', '>': '<',
        '&': '⅋', '_': '‾', '/': '\\', '\\': '/', '|': '|', '^': 'v'
    }

    upside_down_text = ""
    for char in text:
        if char in upside_down_chars:
            upside_down_text += upside_down_chars[char]
        else:
            upside_down_text += char

    return upside_down_text[::-1]
